nbd_fio_results/dev-nbd0_2023-07-17_12:43/seq_w_nbd0_4iodepth/2048.txt
write: (g=0): rw=write, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=4
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=17547: Mon Jul 17 12:49:40 2023
  write: IOPS=791, BW=1582MiB/s (1659MB/s)(30.9GiB/20002msec)
    slat (usec): min=45, max=2646, avg=711.18, stdev=235.99
    clat (usec): min=500, max=8152, avg=4326.18, stdev=971.62
     lat (usec): min=1363, max=8306, avg=5050.98, stdev=910.76
    clat percentiles (usec):
     |  1.00th=[ 2343],  5.00th=[ 2704], 10.00th=[ 3064], 20.00th=[ 3589],
     | 30.00th=[ 3884], 40.00th=[ 4080], 50.00th=[ 4293], 60.00th=[ 4490],
     | 70.00th=[ 4686], 80.00th=[ 5014], 90.00th=[ 5669], 95.00th=[ 6194],
     | 99.00th=[ 6849], 99.50th=[ 6980], 99.90th=[ 7373], 99.95th=[ 7570],
     | 99.99th=[ 8094]
   bw (  MiB/s): min= 1516, max= 1664, per=99.99%, avg=1582.30, stdev=40.63, samples=40
   iops        : min=  758, max=  832, avg=791.15, stdev=20.31, samples=40
  lat (usec)   : 750=0.01%, 1000=0.03%
  lat (msec)   : 2=0.27%, 4=34.88%, 10=64.82%
  cpu          : usr=3.12%, sys=5.61%, ctx=234385, majf=0, minf=529
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15826,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=1582MiB/s (1659MB/s), 1582MiB/s-1582MiB/s (1659MB/s-1659MB/s), io=30.9GiB (33.2GB), run=20002-20002msec

Disk stats (read/write):
  nbd0: ios=0/251777, merge=0/0, ticks=0/984666, in_queue=950439, util=99.67%